STMicroelectronics/x-cube-isp/Projects/DCMIPP_ISP/ISP_IQTune_App/STM32N6570-DK/Src/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @author  AIS Application Team
 * @brief   Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32n6570_discovery.h"
#include "stm32n6570_discovery_bus.h"
#include "stm32n6570_discovery_lcd.h"
#include "stm32n6570_discovery_xspi.h"
#include "isp_api.h"
#include "isp_param_conf.h"
#include "cmw_camera.h"
#ifdef ISP_MW_TUNING_TOOL_SUPPORT
#include "ispiqtune_logo_argb8888.h"
#endif  /* ISP_MW_TUNING_TOOL_SUPPORT */
#include "tx_api.h"
#include "tx_initialize.h"
#include <stdio.h>

/* Global variables ----------------------------------------------------------*/
/* Device handles */
DCMIPP_HandleTypeDef *phDcmipp;
ISP_HandleTypeDef    hIsp;

 /* threads */
static TX_THREAD main_thread;
static uint8_t main_tread_stack[4096];

#ifdef ISP_ENABLE_UVC
#include "usbx_conf.h"
#endif /* ISP_ENABLE_UVC */
/* External function prototypes ----------------------------------------------*/

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  char name[32];             /*!< Sensor name                                      */
  uint32_t CamImgWidth;      /*!< Sensor output width                              */
  uint32_t CamImgHeight;     /*!< Sensor output height                             */
  uint32_t PreviewWidth;     /*!< DCMIPP output width for preview                  */
  uint32_t PreviewHeight;    /*!< DCMIPP output height for preview                 */
  uint32_t SensorDataType;   /*!< CSI2 Datatype to be set for flow selection DTIDA */
  uint32_t BytePerPixel;     /*!< Pixel format size                                */
} CAMERA_SensorConfTypeDef;

typedef struct
{
  uint32_t X0;
  uint32_t Y0;
  uint32_t XSize;
  uint32_t YSize;
} Rectangle_TypeDef;

/* Private define ----------------------------------------------------------*/
#define USE_DCACHE

/* Pixel Format Size */
#define BPP_RAW8       1
#define BPP_RAW10      2
#define BPP_RAW12      2
#define BPP_RAW14      2
#define BPP_RGB565     2
#define BPP_YUV422     2
#define BPP_RGB888     3
#define BPP_ARGB8888   4

/* LCD Size */
#define LCD_WIDTH         RK050HR18_WIDTH
#define LCD_HEIGHT        RK050HR18_HEIGHT

/* Preview frame buffer */
#define MAX_PREVIEW_BUFFER_WIDTH    640
#define MAX_PREVIEW_BUFFER_HEIGHT   480

#ifdef ISP_MW_TUNING_TOOL_SUPPORT
/* Dump frame buffer */
#define MAX_DUMP_BUFFER_SIZE (5 * 1024 * 1024) /* 5 MP */
#endif  /* ISP_MW_TUNING_TOOL_SUPPORT */

/* Private macro -------------------------------------------------------------*/
#ifndef MIN
#define MIN(a, b)  (((a) < (b)) ? (a) : (b))
#endif /* MIN */

/* Private variables ---------------------------------------------------------*/
/* Frame buffers */
/* Allocate the Main_DestBuffer (YUV422) in SRAM dedicated region */
__attribute__ ((section(".buffRam")))
__attribute__ ((aligned (32)))
uint8_t Main_DestBuffer[MAX_PREVIEW_BUFFER_WIDTH * MAX_PREVIEW_BUFFER_HEIGHT * BPP_YUV422];
#ifdef ISP_MW_TUNING_TOOL_SUPPORT
__attribute__ ((section (".psram_bss")))
__attribute__ ((aligned (32)))
uint8_t Dump_DestBuffer[MAX_DUMP_BUFFER_SIZE * BPP_RGB888];
extern uint32_t ISP_AncillaryPipe_FrameCount;
extern uint32_t ISP_DumpPipe_FrameCount;
#endif  /* ISP_MW_TUNING_TOOL_SUPPORT */
__attribute__ ((section (".psram_bss")))
__attribute__ ((aligned (32)))
uint8_t Overlay_Buffer[LCD_WIDTH * LCD_HEIGHT * BPP_ARGB8888];

/* Camera_SensorConf will be filled when Camera_Config is called */
CAMERA_SensorConfTypeDef Camera_SensorConf = {0};

/* LCD full display area */
Rectangle_TypeDef display_area = {
  .X0 = 0,
  .Y0 = 0,
  .XSize = LCD_WIDTH,
  .YSize = LCD_HEIGHT,
};
Rectangle_TypeDef stat_area = {0};
uint8_t DecimationFactor = 1;
uint32_t DisplayFramePitch;
static UART_HandleTypeDef huart1;

/* Private function prototypes -----------------------------------------------*/
static int main_threadx(void);
static void main_thread_fct(ULONG arg);
static void SystemClock_Config(void);
static void Security_Config(void);
static void IAC_Config(void);
static void Console_Config(void);
int Camera_Config(DCMIPP_HandleTypeDef **hDcmipp, uint32_t Instance);
void Display_Config(void);

static void Setup_Mpu(void);

ISP_StatusTypeDef GetSensorInfo(uint32_t camera_instance, ISP_SensorInfoTypeDef *info);
ISP_StatusTypeDef SetSensorGain(uint32_t camera_instance, int32_t gain);
ISP_StatusTypeDef GetSensorGain(uint32_t camera_instance, int32_t *gain);
ISP_StatusTypeDef SetSensorExposure(uint32_t camera_instance, int32_t exposure);
ISP_StatusTypeDef GetSensorExposure(uint32_t camera_instance, int32_t *exposure);

#ifdef ISP_MW_TUNING_TOOL_SUPPORT
ISP_StatusTypeDef Check_StatAreaUpdate(void);
ISP_StatusTypeDef SetSensorTestPattern(uint32_t camera_instance, int32_t mode);
ISP_StatusTypeDef Camera_StartPreview(void *pHdcmipp);
ISP_StatusTypeDef Camera_StopPreview(void *pHdcmipp);
ISP_StatusTypeDef Camera_DumpFrame(void *pHdcmipp, uint32_t Pipe, ISP_DumpCfgTypeDef Config,
                                   uint32_t **pBuffer, ISP_DumpFrameMetaTypeDef *pMeta);
ISP_StatusTypeDef SetIPPlugConf(uint32_t Pipe0_OW, uint32_t Pipe0_PFS,
                                uint32_t Pipe1_OW, uint32_t Pipe1_PFS,
                                uint32_t Pipe2_OW, uint32_t Pipe2_PFS);
#endif  /* ISP_MW_TUNING_TOOL_SUPPORT */

/**
  * @brief  Main program
  * @retval None
  */
int main(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Disable error related to UNALIGN memory structures*/
  SCB->CCR &= ~SCB_CCR_UNALIGN_TRP_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  HAL_Init();

  Setup_Mpu();

  return main_threadx();
}

static void Setup_Mpu(void)
{
  extern uint32_t __uncached_bss_start__;
  extern uint32_t __uncached_bss_end__;

  MPU_Attributes_InitTypeDef attr;
  MPU_Region_InitTypeDef region;

