STMicroelectronics/x-cube-isp/Projects/DCMIPP_ISP/ISP_IQTune_App/STM32N6570-DK/Src/main.c
  attr.Number = MPU_ATTRIBUTES_NUMBER0;
  attr.Attributes = MPU_NOT_CACHEABLE;
  HAL_MPU_ConfigMemoryAttributes(&attr);

  region.Enable = MPU_REGION_ENABLE;
  region.Number = MPU_REGION_NUMBER0;
  region.BaseAddress = (uint32_t)&__uncached_bss_start__;
  region.LimitAddress = (uint32_t)&__uncached_bss_end__ - 1;
  region.AttributesIndex = MPU_ATTRIBUTES_NUMBER0;
  region.AccessPermission = MPU_REGION_ALL_RW;
  region.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  region.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_ENABLE;
  region.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  HAL_MPU_ConfigRegion(&region);

  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

/**
  * @brief  The main entry function tx_application_define()
  *         is then called by ThreadX during kernel starts.
  */
void tx_application_define(void *first_unused_memory)
{
  UNUSED(first_unused_memory);
  const UINT priority = TX_MAX_PRIORITIES / 2 - 1;
  const ULONG time_slice = 10;
  int ret;

  ret = tx_thread_create(&main_thread, "main", main_thread_fct, 0, main_tread_stack,
                         sizeof(main_tread_stack), priority, priority, time_slice, TX_AUTO_START);
  assert(ret == 0);
}

/**
  * @brief  Initialization of ThreadX.
  */
static int main_threadx(void)
{
  _tx_initialize_kernel_setup();
  tx_kernel_enter();
  assert(0);

  return -1;
}

/**
  * @brief  Main ThreadX thread
  */
static void main_thread_fct(ULONG arg)
{
  UNUSED(arg);
  uint32_t preemptPriority;
  uint32_t subPriority;
  IRQn_Type i;
  uint32_t camera_instance = 0;
  ISP_StatusTypeDef ret;

  /* Copy SysTick_IRQn priority set by RTOS and use it as default priorities for IRQs. We are now sure that all irqs
   * have default priority below or equal to configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY.
   */
  HAL_NVIC_GetPriority(SysTick_IRQn, HAL_NVIC_GetPriorityGrouping(), &preemptPriority, &subPriority);
  for (i = PVD_PVM_IRQn; i <= LTDC_UP_ERR_IRQn; i++)
    HAL_NVIC_SetPriority(i, preemptPriority, subPriority);

  /* Call SystemClock_Config() after vTaskStartScheduler() since it call HAL_Delay() which call vTaskDelay(). Drawback
   * is that we must call vPortSetupTimerInterrupt() since SystemCoreClock value has been modified by SystemClock_Config()
   */
  SystemClock_Config();

#ifdef ISP_MW_TUNING_TOOL_SUPPORT
  /* Initialize XSPI memory */
  /* Only needed to store the dump frame */
  BSP_XSPI_RAM_Init(0);
  BSP_XSPI_RAM_EnableMemoryMappedMode(0);
#endif  /* ISP_MW_TUNING_TOOL_SUPPORT */

  /* Set all required IPs as secure privileged */
  Security_Config();
  IAC_Config();

  /* Configure UART for message log */
  Console_Config();

#ifdef ISP_MW_TUNING_TOOL_SUPPORT
  printf("**** Initializing IQ Tuning application  ****\r\n");
#else
  printf("**** Initializing ISP preview application  ****\r\n");
#endif  /* ISP_MW_TUNING_TOOL_SUPPORT */

  /* Initialize the DCMIPP device and the camera */
  if (Camera_Config(&phDcmipp, camera_instance) != 0)
  {
    printf("ERROR: can't configure camera\r\n");
    Error_Handler();
  }

  /* Configure the display */
  Display_Config();

#ifdef ISP_MW_TUNING_TOOL_SUPPORT
  /* Do not rely on Camera Middleware to initialize the ISP device => initialize it by yourself
   * Provide ISP Library with helpers to control non-ISP features (application Helpers are mandatory
   * to get/set sensor exposure or gain)
   * Statistic area is provided with null value so that it forces the ISP Library to get the statistic
   * area information from the tuning file.
   */
  ISP_AppliHelpersTypeDef appliHelpers = {
    .GetSensorInfo = GetSensorInfo,
    .SetSensorGain = SetSensorGain,
    .GetSensorGain = GetSensorGain,
    .SetSensorExposure = SetSensorExposure,
    .GetSensorExposure = GetSensorExposure,
    .StartPreview = Camera_StartPreview,
    .StopPreview = Camera_StopPreview,
    .DumpFrame = Camera_DumpFrame,
    .SetSensorTestPattern = SetSensorTestPattern,
  };
  /* Get the sensor name connected:
   * - UNKNOWN config @ ISP_IQParamCacheInit[0]
   * - IMX335  config @ ISP_IQParamCacheInit[1]
   * - VD66GY  config @ ISP_IQParamCacheInit[2]
   * - VD5943  config @ ISP_IQParamCacheInit[3]
   * - VD1943  config @ ISP_IQParamCacheInit[4]
   * - VD65G4  config @ ISP_IQParamCacheInit[5]
   * - VD56G3  config @ ISP_IQParamCacheInit[6]
   */
  uint8_t sensor_id = 0;
  if (strcmp(Camera_SensorConf.name, "IMX335") == 0)
  {
    sensor_id = 1;
  }
  else if (strcmp(Camera_SensorConf.name, "VD66GY") == 0)
  {
    sensor_id = 2;
  }
  else if (strcmp(Camera_SensorConf.name, "VD5943") == 0)
  {
    sensor_id = 3;
  }
  else if (strcmp(Camera_SensorConf.name, "VD1943") == 0)
  {
    sensor_id = 4;
  }
  else if (strcmp(Camera_SensorConf.name, "VD65G4") == 0)
  {
    sensor_id = 5;
  }
  else if (strcmp(Camera_SensorConf.name, "VD56G3") == 0)
  {
    sensor_id = 6;
  }
  else
  {
    /* For application running on unknown sensor, use untuned sensor configuration*/
    printf("INFO: Unknown sensor, select untuned configuration for isp\r\n");
    sensor_id = 0;
  }

#ifdef ISP_ENABLE_UVC
  /* Define the preview size and fps for the UVC streaming */
  usb_uvc_init(Camera_SensorConf.PreviewWidth, Camera_SensorConf.PreviewHeight, 10/*fps*/);
#endif

  ret = ISP_Init(&hIsp, phDcmipp, camera_instance, &appliHelpers, ISP_IQParamCacheInit[sensor_id]);
  if (ret != ISP_OK)
  {
    printf("ERROR: Can't init ISP (error %d)\r\n", ret);
    Error_Handler();
  }

  /* Get the ISP decimation factor applied in the ISP pipeline */
  ISP_DecimationTypeDef decimation;
  ISP_GetDecimationFactor(&hIsp, &decimation);
  DecimationFactor = decimation.factor;
  printf("INFO: Decimation factor is: %d\r\n", DecimationFactor);

  /* Configure the IPPlug Fifo size for each pipe */
  ret = SetIPPlugConf(Camera_SensorConf.CamImgWidth, Camera_SensorConf.BytePerPixel,
                      Camera_SensorConf.PreviewWidth, BPP_YUV422,
                      Camera_SensorConf.CamImgWidth, BPP_RGB888);
  if (ret != ISP_OK)
  {
    printf("ERROR: Can't configure IPPlug (error %d)\r\n", ret);
    Error_Handler();
  }
#else /* ISP_MW_TUNING_TOOL_SUPPORT */
  (void)ISP_IQParamCacheInit; /* unused */
#endif  /* ISP_MW_TUNING_TOOL_SUPPORT */

  /* Start the main pipe */
  if (CMW_CAMERA_Start(DCMIPP_PIPE1, (uint8_t *) Main_DestBuffer, CMW_MODE_CONTINUOUS) != CMW_ERROR_NONE)
  {
    printf("ERROR: Failed to start CAMERA\r\n");
    Error_Handler();
  }

#ifdef ISP_MW_TUNING_TOOL_SUPPORT
  /* Start the ISP device */
  ret = ISP_Start(&hIsp);
  if (ret != ISP_OK)
  {
    printf("ERROR: Can't start ISP (error %d)\r\n", ret);
    Error_Handler();
  }
#endif  /* ISP_MW_TUNING_TOOL_SUPPORT */

