STMicroelectronics/x-cube-isp/Projects/DCMIPP_ISP/ISP_IQTune_App/STM32N6570-DK/Src/main.c
  printf("Camera and ISP started\r\n");

  /* Application main loop */
  while (1)
  {
#ifdef ISP_MW_TUNING_TOOL_SUPPORT
    tx_thread_sleep(1);
#ifdef ISP_ENABLE_UVC
    int32_t uvc_tx_size = DisplayFramePitch * Camera_SensorConf.PreviewHeight;
    usb_uvc_show_frame((uint8_t *) Main_DestBuffer, uvc_tx_size);
#endif /* ISP_ENABLE_UVC */

    /* Call the ISP background task */
    ret = ISP_BackgroundProcess(&hIsp);
    if (ret != ISP_OK)
    {
      printf("WARNING: ISP Background process error %d (%s)\r\n", ret, ERROR_MESSAGE(ret));
    }

    /* Get the Current statistic area that can be updated by the ISP IQTune */
    Check_StatAreaUpdate();
#else
    ret = CMW_ERROR_NONE;
    ret = CMW_CAMERA_Run();
    assert(ret == CMW_ERROR_NONE);
#endif /* ISP_MW_TUNING_TOOL_SUPPORT */
    /* Additional applicative processing can be implemented from here */
  }
}

/**
  * @brief  Configure the DCMIPP pipe1 for preview
  */
static void DCMIPP_Pipe1Config_Preview(void)
{
  CMW_DCMIPP_Conf_t dcmipp_conf = {0};

  /* Configure Pipe Main */
  dcmipp_conf.output_width = Camera_SensorConf.PreviewWidth;
  dcmipp_conf.output_height = Camera_SensorConf.PreviewHeight;
  dcmipp_conf.output_format = DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
  dcmipp_conf.output_bpp = BPP_YUV422;
  dcmipp_conf.enable_swap = 0;
  dcmipp_conf.enable_gamma_conversion = -1; /* Let the ISP config file to decide */
  dcmipp_conf.mode = CMW_Aspect_ratio_fit;

  if (CMW_CAMERA_SetPipeConfig(DCMIPP_PIPE1, &dcmipp_conf, &DisplayFramePitch) != 0)
  {
    printf("ERROR: can't configure pipe1 for preview\r\n");
    Error_Handler();
  }
}

#ifdef ISP_MW_TUNING_TOOL_SUPPORT
/**
  * @brief  Configure the DCMIPP pipe2 for Live streaming dump
  */
static void DCMIPP_Pipe2Config_DumpLiveStreaming(void)
{
  CMW_DCMIPP_Conf_t dcmipp_conf = {0};
  uint32_t pitch;

  /* Configure Ancillary pipe with downscaling for Live streaming snapshot */
  dcmipp_conf.output_width = Camera_SensorConf.PreviewWidth;
  dcmipp_conf.output_height = Camera_SensorConf.PreviewHeight;
  dcmipp_conf.output_format = DCMIPP_PIXEL_PACKER_FORMAT_RGB888_YUV444_1;
  dcmipp_conf.output_bpp = BPP_RGB888;
  dcmipp_conf.enable_swap = 0;
  dcmipp_conf.enable_gamma_conversion = -1; /* Let the ISP config file to decide */
  dcmipp_conf.mode = CMW_Aspect_ratio_fit;

  if (CMW_CAMERA_SetPipeConfig(DCMIPP_PIPE2, &dcmipp_conf, &pitch) != 0)
  {
    printf("ERROR: can't configure pipe2 for Live streaming dump\r\n");
    Error_Handler();
  }
}

/**
  * @brief  Configure the DCMIPP pipe2 for ISP pipeline RGB888 dump
  */
static void DCMIPP_Pipe2Config_DumpIspRGB888(void)
{
  CMW_DCMIPP_Conf_t dcmipp_conf = {0};
  uint32_t pitch;

  /* Configure Ancillary pipe with downscaling for Live streaming snapshot */
  dcmipp_conf.output_width = Camera_SensorConf.CamImgWidth;
  dcmipp_conf.output_height = Camera_SensorConf.CamImgHeight;
  dcmipp_conf.output_format = DCMIPP_PIXEL_PACKER_FORMAT_RGB888_YUV444_1;
  dcmipp_conf.output_bpp = BPP_RGB888;
  dcmipp_conf.enable_swap = 0;
  dcmipp_conf.enable_gamma_conversion = -1; /* Let the ISP config file to decide */
  dcmipp_conf.mode = CMW_Aspect_ratio_fit;

  if (CMW_CAMERA_SetPipeConfig(DCMIPP_PIPE2, &dcmipp_conf, &pitch) != 0)
  {
    printf("ERROR: can't configure pipe2 for ISP RGB888 dump\r\n");
    Error_Handler();
  }
}

/**
  * @brief  Configure the DCMIPP pipe0 to dump native raw bayer from sensor
  */
static void DCMIPP_Pipe0Config_DumpSensorRaw(void)
{
  CMW_DCMIPP_Conf_t dcmipp_conf = {0};
  uint32_t pitch;

  /* Configure the dump pipe with the sensor full size */
  dcmipp_conf.output_width = Camera_SensorConf.CamImgWidth;
  dcmipp_conf.output_height = Camera_SensorConf.CamImgHeight;

  if (CMW_CAMERA_SetPipeConfig(DCMIPP_PIPE0, &dcmipp_conf, &pitch) != 0)
  {
    printf("ERROR: can't configure pipe0\r\n");
    Error_Handler();
  }
}
#endif  /* ISP_MW_TUNING_TOOL_SUPPORT */

/**
  * @brief  Get the preview size to respect aspect ratio of the camera.
  * @param  cameraWidth   width of the camera frame
  * @param  cameraHeight  height of the camera frame
  * @param  previewWidth  pointer on the calculated preview width
  * @param  previewHeight pointer on the calculated preview height
  */
static void ComputePreviewSize(uint32_t cameraWidth, uint32_t cameraHeight, uint32_t *previewWidth, uint32_t *previewHeight)
{
  /* Camera frame aspect ratio */
  float aspectRatio = (float)cameraWidth / (float)cameraHeight;

  /* Keep camera aspect ratio */
  if (aspectRatio > 1.0f)
  { /* Landscape case */
    *previewWidth = MAX_PREVIEW_BUFFER_WIDTH;
    *previewHeight = (uint32_t)(MAX_PREVIEW_BUFFER_WIDTH / aspectRatio);
    if (*previewHeight > MAX_PREVIEW_BUFFER_HEIGHT)
    {
      *previewHeight = MAX_PREVIEW_BUFFER_HEIGHT;
      *previewWidth = (uint32_t)(MAX_PREVIEW_BUFFER_HEIGHT * aspectRatio);
    }
  }
  else
  { /* Portrait case */
    *previewHeight = MAX_PREVIEW_BUFFER_HEIGHT;
    *previewWidth = (uint32_t)(MAX_PREVIEW_BUFFER_HEIGHT * aspectRatio);
    if (*previewWidth > MAX_PREVIEW_BUFFER_HEIGHT)
    {
      *previewWidth = MAX_PREVIEW_BUFFER_WIDTH;
      *previewHeight = (uint32_t)(MAX_PREVIEW_BUFFER_WIDTH / aspectRatio);
    }
  }

  /* Ensure previewWidth is a multiple of 8, rounded down and not greater than previous value */
  *previewWidth &= (uint32_t)~7u;

  /* Adjust previewHeight to keep aspect ratio after width rounding */
  *previewHeight = (uint32_t)((float)(*previewWidth) / aspectRatio);

  /* Ensure previewHeight is even */
  if (*previewHeight & 1)
    *previewHeight -= 1;
}

/**
  * @brief  Configure the camera
  * @param  hDcmipp Pointer to the dcmipp device
  * @param  Instance Camera instance
  * @retval 0 if success, 1 otherwise
  */
int Camera_Config(DCMIPP_HandleTypeDef **hDcmipp, uint32_t Instance)
{
  int32_t  ret;
  CMW_CameraInit_t initConf = {0};
  UNUSED(Instance);

  initConf.width = 0;  /* width and height not specified => camera full resolution is set */
  initConf.height = 0; /* width and height not specified => camera full resolution is set */
  initConf.fps = 30;
  initConf.mirror_flip = CMW_MIRRORFLIP_NONE; /* CMW_MIRRORFLIP_NONE or CMW_MIRRORFLIP_FLIP or CMW_MIRRORFLIP_MIRROR or CMW_MIRRORFLIP_FLIP_MIRROR */

