STMicroelectronics/x-cube-isp/Projects/DCMIPP_ISP/ISP_IQTune_App/STM32N6570-DK/Src/main.c
  ret = CMW_CAMERA_Init(&initConf, NULL);
  if (ret != CMW_ERROR_NONE)
  {
    printf("ERROR: Failed to Initialize camera\r\n");
    return 1;
  }

  *hDcmipp = CMW_CAMERA_GetDCMIPPHandle();

  /* Make sure manual exposure is set on camera sensor side
   * This has no effect if the camera does not support it.
   */
  ret = CMW_CAMERA_SetExposureMode(CMW_EXPOSUREMODE_MANUAL); /* CMW_EXPOSUREMODE_AUTO or CMW_EXPOSUREMODE_AUTOFREEZE */
  if ((ret != CMW_ERROR_NONE) && (ret != CMW_ERROR_FEATURE_NOT_SUPPORTED))
  {
    printf("ERROR: Failed to set manual exposure\r\n");
    return 1;
  }

  /* Get the sensor information to fill the Camera_SensorConf structure */
  ISP_SensorInfoTypeDef info;
  ret = CMW_CAMERA_GetSensorInfo(&info);
  if (ret != CMW_ERROR_NONE)
  {
    printf("ERROR: Failed to get the sensor information\r\n");
    return 1;
  }
  strncpy(Camera_SensorConf.name, info.name, sizeof(Camera_SensorConf.name));
  Camera_SensorConf.CamImgWidth = info.width;
  Camera_SensorConf.CamImgHeight = info.height;
  ComputePreviewSize(Camera_SensorConf.CamImgWidth,
                     Camera_SensorConf.CamImgHeight,
                     &Camera_SensorConf.PreviewWidth,
                     &Camera_SensorConf.PreviewHeight);
  switch (info.color_depth)
  {
  case 8:
    Camera_SensorConf.SensorDataType = DCMIPP_DT_RAW8;
    Camera_SensorConf.BytePerPixel = BPP_RAW8;
    break;
  case 10:
    Camera_SensorConf.SensorDataType = DCMIPP_DT_RAW10;
    Camera_SensorConf.BytePerPixel = BPP_RAW10;
    break;
  case 12:
    Camera_SensorConf.SensorDataType = DCMIPP_DT_RAW12;
    Camera_SensorConf.BytePerPixel = BPP_RAW12;
    break;
  case 14:
    Camera_SensorConf.SensorDataType = DCMIPP_DT_RAW14;
    Camera_SensorConf.BytePerPixel = BPP_RAW14;
    break;
  default:
    Camera_SensorConf.SensorDataType = DCMIPP_DT_RAW8;
    Camera_SensorConf.BytePerPixel = BPP_RAW8;
  }

  /* Configure the DCMIPP pipes */
  DCMIPP_Pipe1Config_Preview();
#ifdef ISP_MW_TUNING_TOOL_SUPPORT
  DCMIPP_Pipe2Config_DumpLiveStreaming();
  DCMIPP_Pipe0Config_DumpSensorRaw();
#endif  /* ISP_MW_TUNING_TOOL_SUPPORT */

  return 0;
}

/**
  * @brief  Error callback on the pipe. Occurs when overrun occurs on the pipe.
  * @param  Pipe  Pipe receiving the callback
  * @retval None
  */
void CMW_CAMERA_PIPE_ErrorCallback(uint32_t pipe)
{
  UNUSED(pipe);
  printf("WARNING: Overrun detected\r\n");
}

/**
  * @brief  Get the sensor info
  * @param  camera_instance: camera instance
  * @param  info: sensor info
  * @retval Operation result
  */
ISP_StatusTypeDef GetSensorInfo(uint32_t camera_instance, ISP_SensorInfoTypeDef *info)
{
  UNUSED(camera_instance);

  if (CMW_CAMERA_GetSensorInfo(info) != CMW_ERROR_NONE)
    return ISP_ERR_SENSORINFO;

  return ISP_OK;
}

/**
  * @brief  Set the sensor gain
  * @param  camera_instance: camera instance
  * @param  gain: sensor gain to be applied
  * @retval Operation result
  */
ISP_StatusTypeDef SetSensorGain(uint32_t camera_instance, int32_t gain)
{
  UNUSED(camera_instance);

  if (CMW_CAMERA_SetGain(gain) != CMW_ERROR_NONE)
    return ISP_ERR_SENSORGAIN;

  return ISP_OK;
}

/**
  * @brief  Get the sensor gain
  * @param  camera_instance: camera instance
  * @param  gain: current sensor gain
  * @retval Operation result
  */
ISP_StatusTypeDef GetSensorGain(uint32_t camera_instance, int32_t *gain)
{
  UNUSED(camera_instance);

  if (CMW_CAMERA_GetGain(gain) != CMW_ERROR_NONE)
    return ISP_ERR_SENSORGAIN;

  return ISP_OK;
}

/**
  * @brief  Set the sensor exposure
  * @param  Instance: camera instance
  * @param  Gain: sensor exposure to be applied
  * @retval Operation result
  */
ISP_StatusTypeDef SetSensorExposure(uint32_t camera_instance, int32_t exposure)
{
  UNUSED(camera_instance);

  if (CMW_CAMERA_SetExposure(exposure) != CMW_ERROR_NONE)
    return ISP_ERR_SENSOREXPOSURE;

  return ISP_OK;
}

/**
  * @brief  Get the sensor exposure
  * @param  camera_instance: camera instance
  * @param  gain: current sensor gain
  * @retval Operation result
  */
ISP_StatusTypeDef GetSensorExposure(uint32_t camera_instance, int32_t *exposure)
{
  UNUSED(camera_instance);

  if (CMW_CAMERA_GetExposure(exposure) != CMW_ERROR_NONE)
    return ISP_ERR_SENSOREXPOSURE;

  return ISP_OK;
}

#ifdef ISP_MW_TUNING_TOOL_SUPPORT
/**
  * @brief  Draw IQTune Logo
  * @param  FramebufferAddress Buffer address
  * @param  DisplayArea        Coordinates of the display
  * @param  LogoArea           Coordinates of the logo area
  * @retval none
  */
void Draw_ARGB8888_Logo(uint32_t FramebufferAddress, Rectangle_TypeDef DisplayArea, Rectangle_TypeDef LogoArea)
{
  uint32_t bpp = BPP_ARGB8888;
  unsigned char *buf;

  buf = (unsigned char *)FramebufferAddress;
  buf += DisplayArea.XSize * bpp * LogoArea.Y0 + LogoArea.X0 * bpp;
  for (unsigned int j = 0; j < LogoArea.YSize; j++)
    for (unsigned int i = 0; i < LogoArea.XSize; i++)
      ((uint32_t *)buf)[(j* DisplayArea.XSize) + i] = ((uint32_t *)ISPIQTune_logo_argb8888)[(j* LogoArea.XSize) + i];
}

/**
  * @brief  Display the statistic area on the preview
  * @param  void
  * @retval void
  */
static void Display_Logo(void)
{
  Rectangle_TypeDef LogoArea = {
    .X0 = (display_area.XSize - ISPIQTune_logo_argb8888_width - Camera_SensorConf.PreviewWidth) / 2,
    .Y0 = (display_area.YSize - ISPIQTune_logo_argb8888_height) / 2,
    .XSize = ISPIQTune_logo_argb8888_width,
    .YSize = ISPIQTune_logo_argb8888_height,
  };

  if (HAL_LTDC_SetAddress_NoReload(&hlcd_ltdc, (uint32_t) Overlay_Buffer, LTDC_LAYER_2) != HAL_OK)
  {
    printf("ERROR: Failed to update the logo area on the preview\r\n");
  }

  Draw_ARGB8888_Logo((uint32_t) Overlay_Buffer, display_area, LogoArea);

  if (HAL_LTDC_ReloadLayer(&hlcd_ltdc, LTDC_RELOAD_VERTICAL_BLANKING, LTDC_LAYER_2) != HAL_OK)
  {
    printf("ERROR: Failed to display the logo area on the preview\r\n");
  }
}

/**
  * @brief  Draw stat window as a dotted rectangle
  * @param  FramebufferAddress Buffer address
  * @param  DisplayArea        Coordinates of the display
  * @param  StatArea           Coordinates of the stat area
  * @retval none
  */
void Draw_ARGB8888_StatArea(uint32_t FramebufferAddress, Rectangle_TypeDef DisplayArea, Rectangle_TypeDef StatArea)
{
  uint32_t bpp = BPP_ARGB8888;
  uint32_t color = 0xFFFF0000; /* Red*/
  unsigned char *buf;

  Rectangle_TypeDef PreviewArea = {
    .X0 = (display_area.XSize - Camera_SensorConf.PreviewWidth),
    .Y0 = (display_area.YSize - Camera_SensorConf.PreviewHeight),
    .XSize = Camera_SensorConf.PreviewWidth,
    .YSize = Camera_SensorConf.PreviewHeight,
  };

