STMicroelectronics/x-cube-isp/Projects/DCMIPP_ISP/ISP_IQTune_App/STM32N6570-DK/Src/main.c
  buf = (unsigned char *)FramebufferAddress;
  /* Erase previous statistic area (preview part only) */
  buf += (PreviewArea.X0 + DisplayArea.XSize * PreviewArea.Y0) * bpp;
  memset(buf, 0x00, PreviewArea.XSize * bpp);
  for (unsigned int i = PreviewArea.Y0; i < (PreviewArea.Y0 + PreviewArea.YSize); i++) {
    buf += DisplayArea.XSize * bpp;
    memset(buf, 0x00, PreviewArea.XSize * bpp);
  }

  /* Draw top horizontal line */
  buf = (unsigned char *)FramebufferAddress;
  buf += (PreviewArea.X0 + StatArea.X0 + (PreviewArea.Y0 + StatArea.Y0) * DisplayArea.XSize) * bpp;
  for (unsigned int i = 0; i < StatArea.XSize; i++)
    if ((i / 5) % 2)
      ((uint32_t *)buf)[i] = color;

  /* Draw vertical lines */
  for (unsigned int i = 0; i < StatArea.YSize ; i++) {
    if ((i / 5) % 2)
    {
      ((uint32_t *)buf)[0] = color;
      if (StatArea.XSize > 0)
      {
        ((uint32_t *)buf)[StatArea.XSize - 1] = color;
      }
    }
    buf += DisplayArea.XSize * bpp;
  }

  /* Draw bottom horizontal line */
  buf -= DisplayArea.XSize * bpp;
  for (unsigned int i = 0; i < StatArea.XSize; i++)
    if ((i / 5) % 2)
      ((uint32_t *)buf)[i] = color;
}

/**
  * @brief  Display the statistic area on the preview
  * @param  void
  * @retval void
  */
static void Display_StatArea(void)
{
  Rectangle_TypeDef ScaledStatArea = {
    .X0 = (stat_area.X0 * Camera_SensorConf.PreviewWidth) / Camera_SensorConf.CamImgWidth / DecimationFactor,
    .Y0 = (stat_area.Y0 * Camera_SensorConf.PreviewHeight) / Camera_SensorConf.CamImgHeight / DecimationFactor,
    .XSize = (stat_area.XSize * Camera_SensorConf.PreviewWidth) / Camera_SensorConf.CamImgWidth / DecimationFactor,
    .YSize = (stat_area.YSize * Camera_SensorConf.PreviewHeight) / Camera_SensorConf.CamImgHeight / DecimationFactor,
  };

  if (HAL_LTDC_SetAddress_NoReload(&hlcd_ltdc, (uint32_t) Overlay_Buffer, LTDC_LAYER_2) != HAL_OK)
  {
    printf("ERROR: Failed to update the statistic area on the preview\r\n");
  }

  Draw_ARGB8888_StatArea((uint32_t) Overlay_Buffer, display_area, ScaledStatArea);

  if (HAL_LTDC_ReloadLayer(&hlcd_ltdc, LTDC_RELOAD_VERTICAL_BLANKING, LTDC_LAYER_2) != HAL_OK)
  {
    printf("ERROR: Failed to display the statistic area on the preview\r\n");
  }
}

/**
  * @brief  Check if the ISP Statistic Area need to be updated
  * @retval Operation result
  */
ISP_StatusTypeDef Check_StatAreaUpdate(void)
{
  ISP_StatusTypeDef ret;
  ISP_StatAreaTypeDef area;
  ret = ISP_GetStatArea(&hIsp, &area);
  if (ret != ISP_OK)
  {
    printf("WARNING: Not able to retrieve the current statistic area. error %d (%s)\r\n", ret, ERROR_MESSAGE(ret));
  }

  if ((stat_area.X0 == area.X0) && (stat_area.Y0 == area.Y0) && (stat_area.XSize == area.XSize) && (stat_area.YSize == area.YSize))
  {
    return ISP_OK;
  }

  /* Update current statistic area and update display layers */
  stat_area.X0 = area.X0;
  stat_area.Y0 = area.Y0;
  stat_area.XSize = area.XSize;
  stat_area.YSize = area.YSize;

  Display_StatArea();

  return ISP_OK;
}

/**
  * @brief  Set the sensor test pattern
  * @param  camera_instance: camera instance
  * @param  mode: sensor test pattern to be applied
  * @retval Operation result
  */
ISP_StatusTypeDef SetSensorTestPattern(uint32_t camera_instance, int32_t mode)
{
  UNUSED(camera_instance);

  if (CMW_CAMERA_SetTestPattern(mode) != CMW_ERROR_NONE)
    return ISP_ERR_EINVAL;

  return ISP_OK;
}

/**
  * @brief  Helper for ISP to start camera preview
  * @param  hDcmipp Pointer to the dcmipp device
  * @retval ISP status operation
  */
ISP_StatusTypeDef Camera_StartPreview(void *pDcmipp)
{
  DCMIPP_HandleTypeDef *pHdcmipp = (DCMIPP_HandleTypeDef*)pDcmipp;

  /* Check handle validity */
  if (pHdcmipp == NULL)
  {
    return ISP_ERR_EINVAL;
  }

  if (pHdcmipp->PipeState[DCMIPP_PIPE1] == HAL_DCMIPP_PIPE_STATE_BUSY)
  {
    /* Already started */
    return ISP_OK;
  }

  /* Enable Layer 2 */
  BSP_LCD_SetLayerVisible(0,LTDC_LAYER_2, ENABLE);

  if ((pHdcmipp->ErrorCode != 0) || (pHdcmipp->State != HAL_DCMIPP_STATE_READY))
  {
    /* Overrun run may occur just before the pipeline is started: clear the error */
    printf("WARNING: Overrun detected before preview start\r\n");
    pHdcmipp->ErrorCode = 0;
    pHdcmipp->State = HAL_DCMIPP_STATE_READY;
  }

  if (CMW_CAMERA_Resume(DCMIPP_PIPE1) != CMW_ERROR_NONE)
  {
    return ISP_ERR_DCMIPP_START;
  }

  return ISP_OK;
}

/**
  * @brief  Helper for ISP to stop camera preview
  * @param  hDcmipp Pointer to the dcmipp device
  * @retval ISP status operation
  */
ISP_StatusTypeDef Camera_StopPreview(void *pDcmipp)
{
  DCMIPP_HandleTypeDef *pHdcmipp = (DCMIPP_HandleTypeDef*)pDcmipp;

  /* Check handle validity */
  if (pHdcmipp == NULL)
  {
    return ISP_ERR_EINVAL;
  }

  if (CMW_CAMERA_Suspend(DCMIPP_PIPE1) != CMW_ERROR_NONE)
  {
    return ISP_ERR_DCMIPP_STOP;
  }

  /* Disable Layer 2 to avoid refresh from XSPI memory*/
  BSP_LCD_SetLayerVisible(0,LTDC_LAYER_2, DISABLE);

  if ((pHdcmipp->ErrorCode != 0) || (pHdcmipp->State != HAL_DCMIPP_STATE_READY))
  {
    /* Overrun run may occur just after the pipeline is stopped: clear the error */
    printf("WARNING: Overrun detected before preview stop\r\n");
    pHdcmipp->ErrorCode = 0;
    pHdcmipp->State = HAL_DCMIPP_STATE_READY;
  }

  return ISP_OK;
}

/**
  * @brief  Helper for ISP to dump a frame
  * @param  hDcmipp Pointer to the dcmipp device
  * @param  Pipe    Pipe where to perform the dump ('DUMP'(0) or 'ANCILLARY'(2))
  * @param  Config  Dump with the current pipe config, or without downsizing with
  *                 a specific pixel format.
  * @param  pBuffer Pointer to the address of the dumped buffer (output parameter)
  * @param  pMeta   Pointer to buffer meta data (output parameter)
  * @retval ISP status operation
  */
ISP_StatusTypeDef Camera_DumpFrame(void *pDcmipp, uint32_t Pipe, ISP_DumpCfgTypeDef Config,
                                   uint32_t **pBuffer, ISP_DumpFrameMetaTypeDef *pMeta)
{
  DCMIPP_HandleTypeDef *pHdcmipp = (DCMIPP_HandleTypeDef*)pDcmipp;
  uint32_t lastId, timeout = 0;

  /* Check handle validity */
  if ((pHdcmipp == NULL) || (pBuffer == NULL) || (pMeta == NULL))
  {
    return ISP_ERR_EINVAL;
  }

  if (Pipe == DCMIPP_PIPE2)
  {
    /* Dump on pipe2 */
    if (Config == ISP_DUMP_CFG_FULLSIZE_RGB888)
    {
      /* Configure the pipe2 for ISP RGB888 dump */
      DCMIPP_Pipe2Config_DumpIspRGB888();

      /* Maximize IPPlug Fifo size for Ancillary pipe */
      if (SetIPPlugConf(0, 0, 0, 0, Camera_SensorConf.CamImgWidth, BPP_RGB888) != ISP_OK)
      {
        return ISP_ERR_DCMIPP_CONFIGPIPE;
      }
    }
    else if (Config == ISP_DUMP_CFG_DEFAULT)
    {
      /* Configure the pipe2 for live streaming dump */
      DCMIPP_Pipe2Config_DumpLiveStreaming();
    }
    else if (Config == ISP_DUMP_CFG_DUMP_PIPE_SENSOR)
    {
      /* Not supported  on that pipe */
      return ISP_ERR_DCMIPP_CONFIGPIPE;
    }

    /* Dump frame */
    lastId = ISP_GetAncillaryFrameId(&hIsp);
    if (CMW_CAMERA_Start(Pipe, (uint8_t *) Dump_DestBuffer, CMW_MODE_SNAPSHOT) != HAL_OK)
    {
      return ISP_ERR_DCMIPP_START;
    }

    while (ISP_GetAncillaryFrameId(&hIsp) == lastId)
    {
      HAL_Delay(1);
      timeout++;
      if (timeout > 1000)
      {
        return ISP_ERR_DCMIPP_DUMPTIMEOUT;
      }
    }

