STMicroelectronics/x-cube-isp/Projects/DCMIPP_ISP/ISP_IQTune_App/STM32N6570-DK/Src/main.c
    /* Restore IPPlug Fifo size for each pipe */
    if (SetIPPlugConf(Camera_SensorConf.CamImgWidth, Camera_SensorConf.BytePerPixel,
                      Camera_SensorConf.PreviewWidth, BPP_YUV422,
                      Camera_SensorConf.CamImgWidth, BPP_RGB888) != ISP_OK)
    {
      return ISP_ERR_DCMIPP_CONFIGPIPE;
    }

    /* Set output parameters */
    *pBuffer = (uint32_t*)Dump_DestBuffer;
    /* Get frame configuration from hardware registers (no HAL API for that) */
    pMeta->width = (pHdcmipp->Instance->P2DSSZR & DCMIPP_P2DSSZR_HSIZE) >> DCMIPP_P2DSSZR_HSIZE_Pos;
    pMeta->height = (pHdcmipp->Instance->P2DSSZR & DCMIPP_P2DSSZR_VSIZE) >> DCMIPP_P2DSSZR_VSIZE_Pos;
    pMeta->pitch = (pHdcmipp->Instance->P2PPM0PR & DCMIPP_P2PPM0PR_PITCH) >> DCMIPP_P2PPM0PR_PITCH_Pos;
    pMeta->size = pMeta->height * pMeta->pitch;
    pMeta->format = ISP_FORMAT_RGB888;
  }
  else if (Pipe == DCMIPP_PIPE0)
  {
    /* Dump on pipe0 (raw) */
    if (Config != ISP_DUMP_CFG_DUMP_PIPE_SENSOR)
    {
      /* Not supported  on that pipe */
      return ISP_ERR_DCMIPP_CONFIGPIPE;
    }

    /* Maximize IPPlug Fifo size for dump pipe */
    if (SetIPPlugConf(Camera_SensorConf.CamImgWidth, Camera_SensorConf.BytePerPixel, 0, 0, 0, 0) != ISP_OK)
    {
      return ISP_ERR_DCMIPP_CONFIGPIPE;
    }

    lastId = ISP_GetDumpFrameId(&hIsp);
    if (CMW_CAMERA_Start(Pipe, (uint8_t *) Dump_DestBuffer, CMW_MODE_SNAPSHOT) != HAL_OK)
    {
      return ISP_ERR_DCMIPP_START;
    }

    while (ISP_GetDumpFrameId(&hIsp) == lastId)
    {
      HAL_Delay(1);
      timeout++;
      if (timeout > 1000)
      {
        return ISP_ERR_DCMIPP_DUMPTIMEOUT;
      }
    }

    /* Set output paramerters */
    *pBuffer = (uint32_t*)Dump_DestBuffer;

    pMeta->width = Camera_SensorConf.CamImgWidth;
    pMeta->height = Camera_SensorConf.CamImgHeight;
    pMeta->pitch = pMeta->width * Camera_SensorConf.BytePerPixel;
    pMeta->size = pMeta->height * pMeta->width * Camera_SensorConf.BytePerPixel;
    pMeta->format = (ISP_FormatTypeDef) (Camera_SensorConf.SensorDataType - DCMIPP_DT_RAW8 + 1);

    /* Restore IPPlug Fifo size for each pipe */
    if (SetIPPlugConf(Camera_SensorConf.CamImgWidth, Camera_SensorConf.BytePerPixel,
                      Camera_SensorConf.PreviewWidth, BPP_YUV422,
                      Camera_SensorConf.CamImgWidth, BPP_RGB888) != ISP_OK)
    {
      return ISP_ERR_DCMIPP_CONFIGPIPE;
    }
  }
  else
  {
    /* Unsupported pipe dump */
    return ISP_ERR_DCMIPP_CONFIGPIPE;
  }

  return ISP_OK;
}

/**
  * @brief  Configure the FIFO size and outsanting capability for IPPlug client of each pipe
  * @param  Pipe0_OW   Output width of dump pipe
  * @param  Pipe0_PFS  Pixel format size of dump pipe
  * @param  Pipe1_OW   Output width of main pipe
  * @param  Pipe1_PFS  Pixel format size of main pipe
  * @param  Pipe2_OW   Maximum output width of ancillary pipe
  * @param  Pipe2_PFS  Pixel format size of the maximum dump width on ancillary pipe
  * @retval ISP status operation
  */
ISP_StatusTypeDef SetIPPlugConf(uint32_t Pipe0_OW, uint32_t Pipe0_PFS,
                                uint32_t Pipe1_OW, uint32_t Pipe1_PFS,
                                uint32_t Pipe2_OW, uint32_t Pipe2_PFS)
{
  uint32_t Client[DCMIPP_NUM_OF_PIPES] = {DCMIPP_CLIENT1,DCMIPP_CLIENT2,DCMIPP_CLIENT5}; /* AXI master client for Dump Pipe, Main Pipe in RGB and Ancillary pipe*/
  uint32_t PBP[DCMIPP_NUM_OF_PIPES] = {Pipe0_OW * Pipe0_PFS, Pipe1_OW * Pipe1_PFS, Pipe2_OW * Pipe2_PFS}; /* Peak Bandwidth proportion for each pipe*/
  uint32_t PBP_ALL = PBP[0] + PBP[1] + PBP[2];
  DCMIPP_IPPlugConfTypeDef IPPlugCfg = {0};
  uint8_t i;

  IPPlugCfg.MemoryPageSize = DCMIPP_MEMORY_PAGE_SIZE_256BYTES;
  IPPlugCfg.Traffic = DCMIPP_TRAFFIC_BURST_SIZE_128BYTES;
  IPPlugCfg.WLRURatio = 10;

  /* Configure IPPlug for each pipe */
  for (i = 0; i < DCMIPP_NUM_OF_PIPES; i++)
  {
    IPPlugCfg.Client = Client[i];
    IPPlugCfg.MaxOutstandingTransactions = ((16 * PBP[i]/PBP_ALL) >= 1)? (16 * PBP[i]/PBP_ALL) - 1 : 0;
    IPPlugCfg.DPREGStart = IPPlugCfg.DPREGEnd? IPPlugCfg.DPREGEnd + 1 : 0;
    IPPlugCfg.DPREGEnd = MIN((IPPlugCfg.DPREGStart + 640 * PBP[i]/PBP_ALL), 639);

    if (HAL_DCMIPP_SetIPPlugConfig(hIsp.hDcmipp, &IPPlugCfg) != HAL_OK)
    {
      return ISP_ERR_DCMIPP_CONFIGPIPE;
    }
  }

  return ISP_OK;
}
#endif /* ISP_MW_TUNING_TOOL_SUPPORT */

/**
  * @brief  Initialize the LTDC with a preview area (layer1) and a statistic area (layer2)
  * @param  none
  * @retval none
  */
void Display_Config(void)
{
#ifdef ISP_MW_TUNING_TOOL_SUPPORT
  /* Preview area at the right of the display area */
  Rectangle_TypeDef PreviewArea = {
    .X0 = (display_area.XSize - Camera_SensorConf.PreviewWidth),
    .Y0 = (display_area.YSize - Camera_SensorConf.PreviewHeight),
    .XSize = Camera_SensorConf.PreviewWidth,
    .YSize = Camera_SensorConf.PreviewHeight,
  };
#else
  /* Preview area at the middle of the display area */
  Rectangle_TypeDef PreviewArea = {
    .X0 = (display_area.XSize - Camera_SensorConf.PreviewWidth) / 2,
    .Y0 = (display_area.YSize - Camera_SensorConf.PreviewHeight) / 2,
    .XSize = Camera_SensorConf.PreviewWidth,
    .YSize = Camera_SensorConf.PreviewHeight,
  };
#endif /* ISP_MW_TUNING_TOOL_SUPPORT */

  /* Initialized LTDC */
  BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE);

  /* Set configuration of the LTDC Layer 1 */
  /* Initialize the buffer (black color) */
  uint32_t pixel_count = Camera_SensorConf.PreviewWidth * Camera_SensorConf.PreviewHeight;
  uint32_t buffer_size = pixel_count * BPP_YUV422;
  for (uint32_t i = 0; i < pixel_count; ++i)
  {
      ((uint16_t *)Main_DestBuffer)[i] = 0x8010u;
  }
  SCB_CleanInvalidateDCache_by_Addr (Main_DestBuffer, (int32_t)buffer_size);

  /* Configure the YUV422 preview layer */
  LTDC_LayerFlexYUVCoPlanarTypeDef pLayerFlexYUVCoP = {0};
  pLayerFlexYUVCoP.Layer.WindowX0 = PreviewArea.X0;
  pLayerFlexYUVCoP.Layer.WindowX1 = PreviewArea.X0 + PreviewArea.XSize;
  pLayerFlexYUVCoP.Layer.WindowY0 = PreviewArea.Y0;
  pLayerFlexYUVCoP.Layer.WindowY1 = PreviewArea.Y0 + PreviewArea.YSize;
  pLayerFlexYUVCoP.Layer.Alpha = LTDC_LxCACR_CONSTA;
  pLayerFlexYUVCoP.Layer.Alpha0 = 0;
  pLayerFlexYUVCoP.Layer.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  pLayerFlexYUVCoP.Layer.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
  pLayerFlexYUVCoP.Layer.ImageWidth = PreviewArea.XSize;
  pLayerFlexYUVCoP.Layer.ImageHeight = PreviewArea.YSize;
  pLayerFlexYUVCoP.Layer.Backcolor.Blue = 0;
  pLayerFlexYUVCoP.Layer.Backcolor.Green = 0;
  pLayerFlexYUVCoP.Layer.Backcolor.Red = 0;
  pLayerFlexYUVCoP.FlexYUV.YUVOrder = LTDC_YUV_ORDER_LUMINANCE_FIRST;
  pLayerFlexYUVCoP.FlexYUV.LuminanceOrder = LTDC_YUV_LUMINANCE_ORDER_EVEN_FIRST;
  pLayerFlexYUVCoP.FlexYUV.ChrominanceOrder = LTDC_YUV_CHROMIANCE_ORDER_U_FIRST;
  pLayerFlexYUVCoP.FlexYUV.LuminanceRescale = LTDC_YUV_LUMINANCE_RESCALE_DISABLE;
  pLayerFlexYUVCoP.YUVAddress = (uint32_t) Main_DestBuffer;
  pLayerFlexYUVCoP.ColorConverter = LTDC_YUV2RGBCONVERTOR_BT709_FULL_RANGE;

